{
  "name": "Александр Жебит",
  "about": {
    "title": "Обо мне",
    "text": {
      "first": "Опытный инженер-программист с опытом работы в",
      "second": "Имеет более 3 лет опыта работы в индустрии с экспертизой во фронтенд и фулл-стек разработке. Недавно вернулся к работе после годичного перерыва и стремится применить свои навыки и знания для участия в инновационных проектах."
    },
    "target": "веб-разработка"
  },
  "experience": {
    "title": "Опыт",
    "position": "Инженер-программист",
    "done": {
      "d1": "Разрабатывал и поддерживал веб-приложения, используя такие технологии, как JavaScript, TypeScript, .Net, React, Angular, NodeJS и SQL.",
      "d2": "Сотрудничал с командами разных специализаций для создания качественных программных решений.",
      "d3": "Участвовал в код-ревью, устранении неполадок и оптимизационных работах для повышения производительности и надежности приложений."
    }
  },
  "expertise": {
    "title": "Навыки"
  },
  "certificates": {
    "title": "Сертификаты"
  },
  "education": {
    "title": "Образование",
    "degree": "Бакалаврская степень",
    "university": "Гомельский государственный университет имени Франциска Скорины"
  },
  "projects": {
    "title": "Проекты",
    "achievements": "Основные достижения и вклад",
    "ey": {
      "position": "Ведущий фронтенд / фулл-стек инженер",
      "description": "Ernst & Young (EY) Raptor — это защищенная облачная технологическая платформа, известная как EY Global Tax Platform (GTP). Эта платформа интегрирует различные источники данных и предоставляет продвинутую аналитику, панели мониторинга и возможности отчетности, обеспечивая полную видимость и соблюдение требований в области финансов и налогообложения. GTP предназначена для того, чтобы помочь организациям более эффективно управлять своими налоговыми функциями, используя данные и технологии для трансформации, роста и эффективной работы.",
      "done": {
        "d1": "Возглавил усилия по разработке фронтенда в качестве ведущего инженера, руководя проектированием, разработкой и оптимизацией модульных и многоразовых компонентов.",
        "d2": "Проектировал и внедрял модули функций со сложной логикой и перехватчиками, обеспечивая бесперебойный пользовательский опыт в разных версиях приложения.",
        "d3": "Улучшил производительность и отзывчивость приложения с помощью оптимизационных техник, что привело к увеличению отзывчивости приложения на 20% и сокращению времени разработки на 30%.",
        "d4": "Провел масштабную очистку кодовой базы, повысив качество кода и снизив технический долг, что улучшило поддержку и масштабируемость.",
        "d5": "Увеличил покрытие тестами с 30% до 70%, обеспечив надежность и стабильность приложения.",
        "d6": "Сыграл ключевую роль в поддержке и улучшении системы Micro Frontend (MFE), включая генерацию чанков, ленивую загрузку и решение критических проблем.",
        "d7": "Наставлял UI-разработчиков из других команд, способствуя культуре непрерывного обучения и обмена знаниями.",
        "d8": "Оказывал базовую поддержку DevOps, включая управление переменными, перезапуск подов и оптимизацию Git-процесса с помощью pre-push hooks.",
        "d9": "Активно выявлял и устранял производственные проблемы, обеспечивая бесперебойную работу приложений и минимизируя простои.",
        "d10": "Внес вклад в разработку новых конечных точек, таблиц и миграций, решая критически важные бизнес-задачи и поддерживая функции импорта/экспорта."
      }
    },
    "mpre": {
      "position": "Фронтенд инженер",
      "description": "MPRE — швейцарская компания, специализирующаяся на услугах в области ипотечного кредитования и недвижимости. Платформа объединяет поиск недвижимости, оценку и финансовые решения, используя продвинутую аналитику данных для предоставления персонализированных, прозрачных и эффективных инструментов управления недвижимостью, поддерживая пользователей на всех этапах жизненного цикла недвижимости.",
      "done": {
        "d1": "Возглавил усилия по разработке фронтенда, тесно сотрудничая с межфункциональными командами для предоставления комплексных решений.",
        "d2": "Улучшил пользовательский интерфейс и масштабируемость платформы, используя Angular, Angular Material и ChartJs, что привело к более интуитивно понятному и эффективному пользовательскому опыту.",
        "d3": "Интегрировал Google API, включая Google Maps, Google Streetview и Google Analytics, для предоставления расширенной функциональности и пользовательской аналитики.",
        "d4": "Рефакторил и редизайнил исходный код."
      }
    },
    "raycast": {
      "position": "Open Source",
      "description": "Raycast — это коллекция мощных инструментов для повышения продуктивности, интегрированных в расширяемый лаунчер. Он повышает эффективность рабочего процесса с помощью широкого спектра утилит, делая повседневные задачи быстрее и проще.",
      "downloads": "downloads",
      "extensions": "Расширения",
      "done": {
        "d1": "Позволяет пользователям быстро проверять скорость интернета прямо в приложении Raycast.",
        "d2": "Улучшает рабочие процессы разработчиков, предоставляя необходимые инструменты для консоли.",
        "d3": "Предлагает команду для отключения/включения звукового ввода, а также расширение в строке меню, показывающее текущий статус и позволяющее переключать состояние щелчком."
      }
    }
  },
  "download": {
    "title": "Скачать резюме"
  }
}
